---
kind: method
id: M:Autodesk.Revit.Exceptions.RevitServerUnauthorizedException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
source: html/8a8a2232-e7f8-f7ee-7948-a8fa67ded247.htm
---
# Autodesk.Revit.Exceptions.RevitServerUnauthorizedException.GetObjectData Method

Retrieves data needed to serialize the target object.

## Syntax (C#)
```csharp
public override void GetObjectData(
	SerializationInfo info,
	StreamingContext context
)
```

## Parameters
- **info** (`System.Runtime.Serialization.SerializationInfo`) - Data needed to serialize or deserialize the object.
- **context** (`System.Runtime.Serialization.StreamingContext`) - The destination of the serialized stream.